[
    {
      "id": 1,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/H2QkJW9/book1.jpg",
      "review": "J.D. Salinger's 'The Catcher in the Rye' is a timeless classic that delves deep into the struggles of adolescence and the search for authenticity. Narrated by the iconic Holden Caulfield, the novel takes readers on a journey through the complexities of teenage angst, alienation, and societal expectations. Salinger's masterful storytelling captures the essence of youth rebellion and the longing for connection in a world filled with phoniness. Through Caulfield's cynical yet introspective voice, the reader is compelled to confront existential questions about identity, belonging, and the meaning of life. 'The Catcher in the Rye' remains as relevant today as it was when first published, resonating with readers of all ages with its poignant portrayal of the human condition.",
      "totalPages": 224,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["Coming of Age", "Literary Fiction"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "id": 2,
      "bookName": "George Orwell 1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/Ng0PRWH/book2.jpg",
      "review": "George Orwell's '1984' is a chilling portrayal of a dystopian society that serves as a stark warning about the dangers of totalitarianism. Set in a future where individuality and freedom are suppressed by a totalitarian regime, the novel follows Winston Smith, a low-ranking member of the ruling Party, as he rebels against the oppressive control of Big Brother. Through Smith's journey of defiance and disillusionment, Orwell paints a bleak picture of a world where truth is distorted, history is rewritten, and dissent is brutally crushed. '1984' remains a haunting reminder of the fragility of democracy and the importance of safeguarding civil liberties in the face of tyranny. Orwell's prophetic vision continues to resonate with readers, inspiring critical reflection on the power dynamics of society and the ever-present threat of authoritarianism.",
      "totalPages": 328,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Dystopian", "Political Fiction"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "id": 3,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/X5KFwjK/book3.jpg",
      "review": "Harper Lee's 'To Kill a Mockingbird' is a poignant exploration of racial injustice and moral growth set in the American South. Through the eyes of young Scout Finch, the novel confronts the deep-rooted prejudices and social inequalities prevalent in 1930s Alabama. At the center of the story is Atticus Finch, Scout's father and a principled lawyer who defends a black man falsely accused of raping a white woman. As the trial unfolds, Lee skillfully exposes the hypocrisy and bigotry of a segregated society, challenging readers to confront their own biases and prejudices. 'To Kill a Mockingbird' is more than a legal drama; it's a timeless meditation on the nature of empathy, compassion, and the quest for justice in an imperfect world.",
      "totalPages": 281,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Legal Drama", "Southern Gothic"],
      "publisher": "J.B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "id": 4,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/MC1V4MF/book4.jpg",
      "review": "F. Scott Fitzgerald's 'The Great Gatsby' is an exquisite portrayal of the Jazz Age and the elusive American Dream. Set against the backdrop of the opulent Long Island society in the 1920s, the novel follows the enigmatic Jay Gatsby and his obsession with the beautiful Daisy Buchanan. Through Gatsby's extravagant parties and futile pursuit of wealth and status, Fitzgerald exposes the hollowness of the American Dream and the disillusionment that accompanies the relentless pursuit of material success. With its lush prose and vivid characters, 'The Great Gatsby' captures the decadence and excesses of the Roaring Twenties while also offering a poignant critique of the shallow values that underpin society. Fitzgerald's masterpiece continues to captivate readers with its timeless themes of love, longing, and the quest for meaning in a world driven by illusion.",
      "totalPages": 180,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Romance", "Tragedy"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
    },
    {
      "id": 5,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/L5KW59m/book5.jpg",
      "review": "Jane Austen's 'Pride and Prejudice' is a delightful comedy of manners that remains relevant through its exploration of social norms and love. Set in early 19th-century England, the novel follows the spirited Elizabeth Bennet as she navigates the complexities of society and the expectations placed upon women of her time. Central to the story is Elizabeth's tumultuous relationship with the proud and enigmatic Mr. Darcy, whose initial disdain masks his growing admiration for her wit and intelligence. Through sharp wit and keen observation, Austen satirizes the conventions of Georgian society while also celebrating the enduring power of love to transcend social barriers. 'Pride and Prejudice' endures as a timeless romance, enchanting readers with its sparkling dialogue, memorable characters, and timeless message of love and forgiveness.",
      "totalPages": 279,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["Romance", "Satire"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "id": 6,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/h79wR58/book6.jpg",
      "review": "J.R.R. Tolkien's 'The Hobbit' is an enchanting adventure that introduces readers to the captivating world of Middle-earth. The story follows Bilbo Baggins, a reluctant hobbit who is swept into an epic quest to reclaim the lost kingdom of Erebor from the fearsome dragon Smaug. Joined by a band of dwarves and the wizard Gandalf, Bilbo embarks on a journey filled with peril, magic, and discovery. Along the way, he encounters trolls, goblins, and the mysterious creature Gollum, as well as elves, wizards, and dragons. Tolkien.",
      "totalPages": 310,
      "rating": 4.8,
      "category": "Fantasy",
      "tags": ["Adventure", "Quest"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
    }
  ]
  